vanbwodonk/TeensyDuino-Patch-At90usbkey/hardware/teensy/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout

usbkey.name=AT90USBKEY
usbkey.upload.protocol=avr109
usbkey.upload.maximum_size=126976
usbkey.upload.maximum_ram_size=8192
usbkey.upload.speed=12000000
usbkey.upload.disable_flushing=true
usbkey.bootloader.path=undefined
usbkey.serial.restart_cmd=true
usbkey.serial.safe_baud_rates_only=true
#usbkey.upload.avrdude_wrapper=teensy_reboot
usbkey.build.mcu=at90usb1287
usbkey.build.core=teensy
usbkey.build.elide_constructors=true
usbkey.build.cpp0x=true
usbkey.build.dependency=true
usbkey.build.linker_relaxation=true
usbkey.build.post_compile_script=teensy_post_compile
usbkey.build.serial_number=true
usbkey.menu.usb.serial.name=Serial
usbkey.menu.usb.serial.build.define0=-DUSB_SERIAL
usbkey.menu.usb.hid.name=Keyboard + Mouse + Joystick
usbkey.menu.usb.hid.build.define0=-DUSB_HID
usbkey.menu.usb.hid.fake_serial=teensy_gateway
usbkey.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
usbkey.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
usbkey.menu.usb.int_disk.name=Disk(Internal) + Keyboard
usbkey.menu.usb.int_disk.build.define0=-DUSB_DISK
usbkey.menu.usb.int_disk.fake_serial=teensy_gateway
usbkey.menu.usb.int_disk.build.elfpatch=mktinyfat
usbkey.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
usbkey.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
usbkey.menu.usb.sd_disk.fake_serial=teensy_gateway
usbkey.menu.usb.midi.name=MIDI
usbkey.menu.usb.midi.build.define0=-DUSB_MIDI
usbkey.menu.usb.midi.fake_serial=teensy_gateway
usbkey.menu.usb.rawhid.name=Raw HID
usbkey.menu.usb.rawhid.build.define0=-DUSB_RAWHID
usbkey.menu.usb.rawhid.fake_serial=teensy_gateway
usbkey.menu.usb.flightsim.name=Flight Sim Controls
usbkey.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
usbkey.menu.usb.flightsim.fake_serial=teensy_gateway
usbkey.menu.speed.16.name=16 MHz
usbkey.menu.speed.8.name=8 MHz
usbkey.menu.speed.4.name=4 MHz
usbkey.menu.speed.2.name=2 MHz
usbkey.menu.speed.1.name=1 MHz
usbkey.menu.speed.16.build.f_cpu=16000000L
usbkey.menu.speed.8.build.f_cpu=8000000L
usbkey.menu.speed.4.build.f_cpu=4000000L
usbkey.menu.speed.2.build.f_cpu=2000000L
usbkey.menu.speed.1.build.f_cpu=1000000L
usbkey.menu.keys.en-us.name=US English
usbkey.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
usbkey.menu.keys.fr-ca.name=Canadian French
usbkey.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
usbkey.menu.keys.xx-ca.name=Canadian Multilingual
usbkey.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
usbkey.menu.keys.da-da.name=Danish
usbkey.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
usbkey.menu.keys.fi-fi.name=Finnish
usbkey.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
usbkey.menu.keys.fr-fr.name=French
usbkey.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
usbkey.menu.keys.fr-be.name=French Belgian
usbkey.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
usbkey.menu.keys.fr-ch.name=French Swiss
usbkey.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
usbkey.menu.keys.de-de.name=German
usbkey.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
usbkey.menu.keys.de-dm.name=German (Mac)
usbkey.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
usbkey.menu.keys.de-ch.name=German Swiss
usbkey.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
usbkey.menu.keys.is-is.name=Icelandic
usbkey.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
usbkey.menu.keys.en-ie.name=Irish
usbkey.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
usbkey.menu.keys.it-it.name=Italian
usbkey.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
usbkey.menu.keys.no-no.name=Norwegian
usbkey.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
usbkey.menu.keys.pt-pt.name=Portuguese
usbkey.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
usbkey.menu.keys.pt-br.name=Portuguese Brazilian
usbkey.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
usbkey.menu.keys.es-es.name=Spanish
usbkey.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
usbkey.menu.keys.es-mx.name=Spanish Latin America
usbkey.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
usbkey.menu.keys.sv-se.name=Swedish
usbkey.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
usbkey.menu.keys.en-gb.name=United Kingdom
usbkey.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
usbkey.menu.keys.usint.name=US International
usbkey.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensy3.name=Teensy 3.0
teensy3.upload.protocol=halfkay
teensy3.upload.maximum_size=131072
teensy3.upload.maximum_ram_size=16384
teensy3.upload.speed=12000000
teensy3.upload.disable_flushing=true
teensy3.bootloader.path=undefined
teensy3.serial.restart_cmd=true
teensy3.serial.safe_baud_rates_only=true
teensy3.upload.avrdude_wrapper=teensy_reboot
teensy3.build.mcu=mk20dx128
teensy3.build.cpu=cortex-m4
teensy3.build.option1=-mthumb
teensy3.build.option2=-nostdlib
teensy3.build.option3=-D__MK20DX128__
teensy3.build.cppoption1=-fno-rtti
teensy3.build.linkoption1=-mthumb 
teensy3.build.linkscript=mk20dx128.ld
teensy3.build.architecture=arm-none-eabi
teensy3.build.command.gcc=arm-none-eabi-gcc
teensy3.build.command.g++=arm-none-eabi-g++
teensy3.build.command.ar=arm-none-eabi-ar
teensy3.build.command.objcopy=arm-none-eabi-objcopy
teensy3.build.command.objdump=arm-none-eabi-objdump
teensy3.build.command.size=arm-none-eabi-size
teensy3.build.core=teensy3
teensy3.build.noarchive=true
teensy3.build.elide_constructors=true
teensy3.build.gnu0x=true
teensy3.build.dependency=true
teensy3.build.time_t=true
#teensy3.build.linker_relaxation=true
teensy3.build.post_compile_script=teensy_post_compile
#teensy3.build.serial_number=true
teensy3.menu.usb.serial.name=Serial
teensy3.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy3.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensy3.menu.usb.hid.build.define0=-DUSB_HID
teensy3.menu.usb.hid.fake_serial=teensy_gateway
teensy3.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensy3.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
#teensy3.menu.usb.int_disk.name=Disk(Internal) + Keyboard
#teensy3.menu.usb.int_disk.build.define0=-DUSB_DISK
#teensy3.menu.usb.int_disk.fake_serial=teensy_gateway
#teensy3.menu.usb.int_disk.build.elfpatch=mktinyfat
#teensy3.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
#teensy3.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
#teensy3.menu.usb.sd_disk.fake_serial=teensy_gateway
teensy3.menu.usb.midi.name=MIDI
teensy3.menu.usb.midi.build.define0=-DUSB_MIDI
teensy3.menu.usb.midi.fake_serial=teensy_gateway
teensy3.menu.usb.rawhid.name=Raw HID
teensy3.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy3.menu.usb.rawhid.fake_serial=teensy_gateway
teensy3.menu.usb.flightsim.name=Flight Sim Controls
teensy3.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy3.menu.usb.flightsim.fake_serial=teensy_gateway
teensy3.menu.speed.96.name=96 MHz (overclock)
teensy3.menu.speed.48.name=48 MHz
teensy3.menu.speed.24.name=24 MHz
teensy3.menu.speed.96.build.f_cpu=96000000
teensy3.menu.speed.48.build.f_cpu=48000000
teensy3.menu.speed.24.build.f_cpu=24000000
teensy3.menu.keys.en-us.name=US English
teensy3.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy3.menu.keys.fr-ca.name=Canadian French
teensy3.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy3.menu.keys.xx-ca.name=Canadian Multilingual
teensy3.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy3.menu.keys.da-da.name=Danish
teensy3.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy3.menu.keys.fi-fi.name=Finnish
teensy3.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy3.menu.keys.fr-fr.name=French
teensy3.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy3.menu.keys.fr-be.name=French Belgian
teensy3.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy3.menu.keys.fr-ch.name=French Swiss
teensy3.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy3.menu.keys.de-de.name=German
teensy3.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy3.menu.keys.de-dm.name=German (Mac)
teensy3.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy3.menu.keys.de-ch.name=German Swiss
teensy3.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy3.menu.keys.is-is.name=Icelandic
teensy3.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy3.menu.keys.en-ie.name=Irish
teensy3.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy3.menu.keys.it-it.name=Italian
teensy3.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy3.menu.keys.no-no.name=Norwegian
teensy3.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy3.menu.keys.pt-pt.name=Portuguese
teensy3.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy3.menu.keys.pt-br.name=Portuguese Brazilian
teensy3.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy3.menu.keys.es-es.name=Spanish
teensy3.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy3.menu.keys.es-mx.name=Spanish Latin America
teensy3.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy3.menu.keys.sv-se.name=Swedish
teensy3.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy3.menu.keys.tr-tr.name=Turkish (partial)
teensy3.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy3.menu.keys.en-gb.name=United Kingdom
teensy3.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy3.menu.keys.usint.name=US International
teensy3.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

